dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_GETH_MAC_CONFIGURATION_FES_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_GETH_MAC_CONFIGURATION_FES_OFF (14u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_GETH_MAC_CONFIGURATION_PS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_GETH_MAC_CONFIGURATION_PS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_GETH_MAC_CONFIGURATION_PS_OFF (15u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_GETH_MAC_CONFIGURATION_JE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_GETH_MAC_CONFIGURATION_JE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_GETH_MAC_CONFIGURATION_JE_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_GETH_MAC_CONFIGURATION_JD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_GETH_MAC_CONFIGURATION_JD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_GETH_MAC_CONFIGURATION_JD_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_GETH_MAC_CONFIGURATION_BE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_GETH_MAC_CONFIGURATION_BE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_GETH_MAC_CONFIGURATION_BE_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.WD */
#define IFX_GETH_MAC_CONFIGURATION_WD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.WD */
#define IFX_GETH_MAC_CONFIGURATION_WD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.WD */
#define IFX_GETH_MAC_CONFIGURATION_WD_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_GETH_MAC_CONFIGURATION_ACS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_GETH_MAC_CONFIGURATION_ACS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_GETH_MAC_CONFIGURATION_ACS_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_GETH_MAC_CONFIGURATION_CST_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_GETH_MAC_CONFIGURATION_CST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_GETH_MAC_CONFIGURATION_CST_OFF (21u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.S2KP */
#define IFX_GETH_MAC_CONFIGURATION_S2KP_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.S2KP */
#define IFX_GETH_MAC_CONFIGURATION_S2KP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.S2KP */
#define IFX_GETH_MAC_CONFIGURATION_S2KP_OFF (22u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.GPSLCE */
#define IFX_GETH_MAC_CONFIGURATION_GPSLCE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.GPSLCE */
#define IFX_GETH_MAC_CONFIGURATION_GPSLCE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.GPSLCE */
#define IFX_GETH_MAC_CONFIGURATION_GPSLCE_OFF (23u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.IPG */
#define IFX_GETH_MAC_CONFIGURATION_IPG_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.IPG */
#define IFX_GETH_MAC_CONFIGURATION_IPG_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.IPG */
#define IFX_GETH_MAC_CONFIGURATION_IPG_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_GETH_MAC_CONFIGURATION_IPC_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_GETH_MAC_CONFIGURATION_IPC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_GETH_MAC_CONFIGURATION_IPC_OFF (27u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.SARC */
#define IFX_GETH_MAC_CONFIGURATION_SARC_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.SARC */
#define IFX_GETH_MAC_CONFIGURATION_SARC_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.SARC */
#define IFX_GETH_MAC_CONFIGURATION_SARC_OFF (28u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.GPSL */
#define IFX_GETH_MAC_EXT_CONFIGURATION_GPSL_LEN (14u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.GPSL */
#define IFX_GETH_MAC_EXT_CONFIGURATION_GPSL_MSK (0x3fffu)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.GPSL */
#define IFX_GETH_MAC_EXT_CONFIGURATION_GPSL_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.DCRCC */
#define IFX_GETH_MAC_EXT_CONFIGURATION_DCRCC_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.DCRCC */
#define IFX_GETH_MAC_EXT_CONFIGURATION_DCRCC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.DCRCC */
#define IFX_GETH_MAC_EXT_CONFIGURATION_DCRCC_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.SPEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_SPEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.SPEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_SPEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.SPEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_SPEN_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.USP */
#define IFX_GETH_MAC_EXT_CONFIGURATION_USP_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.USP */
#define IFX_GETH_MAC_EXT_CONFIGURATION_USP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.USP */
#define IFX_GETH_MAC_EXT_CONFIGURATION_USP_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.HDSMS */
#define IFX_GETH_MAC_EXT_CONFIGURATION_HDSMS_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.HDSMS */
#define IFX_GETH_MAC_EXT_CONFIGURATION_HDSMS_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.HDSMS */
#define IFX_GETH_MAC_EXT_CONFIGURATION_HDSMS_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_EXT_CONFIGURATION_Bits.EIPGEN */
#define IFX_GETH_MAC_EXT_CONFIGURATION_EIPGEN_LEN (1u)

