dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGPIS_OFF (3u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX64OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX64OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX64OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX64OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX64OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX64OCTGBPIS_OFF (4u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX65T127OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX65T127OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX65T127OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_OFF (5u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX128T255OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX128T255OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX128T255OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_OFF (6u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX256T511OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX256T511OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX256T511OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_OFF (7u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX512T1023OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX512T1023OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX512T1023OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_OFF (8u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_OFF (9u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUCGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUCGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUCGBPIS_OFF (10u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGBPIS_OFF (11u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGBPIS_OFF (12u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUFLOWERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUFLOWERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUFLOWERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUFLOWERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUFLOWERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUFLOWERPIS_OFF (13u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXSCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXSCOLGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXSCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXSCOLGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXSCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXSCOLGPIS_OFF (14u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCOLGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCOLGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCOLGPIS_OFF (15u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXDEFPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXDEFPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXDEFPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXDEFPIS_OFF (16u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLATCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLATCOLPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLATCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLATCOLPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXLATCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXLATCOLPIS_OFF (17u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXCOLPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXCOLPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXEXCOLPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXEXCOLPIS_OFF (18u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXCARERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXCARERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXCARERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXCARERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXCARERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXCARERPIS_OFF (19u)

