dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXUCGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXUCGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXUCGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXUCGBPIM_OFF (10u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXMCGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXMCGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXMCGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXMCGBPIM_OFF (11u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXBCGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXBCGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXBCGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXBCGBPIM_OFF (12u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXUFLOWERPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXUFLOWERPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXUFLOWERPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM_OFF (13u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXSCOLGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXSCOLGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXSCOLGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM_OFF (14u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXMCOLGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXMCOLGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXMCOLGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_OFF (15u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXDEFPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXDEFPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXDEFPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXDEFPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXDEFPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXDEFPIM_OFF (16u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXLATCOLPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXLATCOLPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXLATCOLPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_OFF (17u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXEXCOLPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXEXCOLPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXEXCOLPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_OFF (18u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXCARERPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXCARERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXCARERPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXCARERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXCARERPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXCARERPIM_OFF (19u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGOCTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGOCTIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGOCTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGOCTIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGOCTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGOCTIM_OFF (20u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGPKTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGPKTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGPKTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM_OFF (21u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXEXDEFPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXEXDEFPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXEXDEFPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_OFF (22u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXPAUSPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXPAUSPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXPAUSPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_OFF (23u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXVLANGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXVLANGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXVLANGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_OFF (24u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXOSIZEGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXOSIZEGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXOSIZEGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_OFF (25u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXLPIUSCIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXLPIUSCIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXLPIUSCIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM_OFF (26u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXLPITRCIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXLPITRCIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM_MSK (0x1u)

