dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MTL_RXQ0_CONTROL_Bits.RXQ_WEGT */
#define IFX_GETH_MTL_RXQ0_CONTROL_RXQ_WEGT_LEN (3u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_CONTROL_Bits.RXQ_WEGT */
#define IFX_GETH_MTL_RXQ0_CONTROL_RXQ_WEGT_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_CONTROL_Bits.RXQ_WEGT */
#define IFX_GETH_MTL_RXQ0_CONTROL_RXQ_WEGT_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_RXQ0_CONTROL_Bits.RXQ_FRM_ARBIT */
#define IFX_GETH_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ0_CONTROL_Bits.RXQ_FRM_ARBIT */
#define IFX_GETH_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ0_CONTROL_Bits.RXQ_FRM_ARBIT */
#define IFX_GETH_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_OFF (3u)

/** \brief Length for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.FTQ */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_FTQ_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.FTQ */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_FTQ_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.FTQ */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_FTQ_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TSF */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TSF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TSF */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TSF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TSF */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TSF_OFF (1u)

/** \brief Length for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TXQEN */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TXQEN_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TXQEN */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TXQEN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TXQEN */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TXQEN_OFF (2u)

/** \brief Length for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TTC */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TTC_LEN (3u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TTC */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TTC_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TTC */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TTC_OFF (4u)

/** \brief Length for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TQS */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TQS_LEN (4u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TQS */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TQS_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MTL_TXQ_OPERATION_MODE_Bits.TQS */
#define IFX_GETH_MTL_TXQ_OPERATION_MODE_TQS_OFF (16u)

/** \brief Length for Ifx_GETH_MTL_TXQ_UNDERFLOW_Bits.UFFRMCNT */
#define IFX_GETH_MTL_TXQ_UNDERFLOW_UFFRMCNT_LEN (11u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_UNDERFLOW_Bits.UFFRMCNT */
#define IFX_GETH_MTL_TXQ_UNDERFLOW_UFFRMCNT_MSK (0x7ffu)

/** \brief Offset for Ifx_GETH_MTL_TXQ_UNDERFLOW_Bits.UFFRMCNT */
#define IFX_GETH_MTL_TXQ_UNDERFLOW_UFFRMCNT_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_TXQ_UNDERFLOW_Bits.UFCNTOVF */
#define IFX_GETH_MTL_TXQ_UNDERFLOW_UFCNTOVF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_UNDERFLOW_Bits.UFCNTOVF */
#define IFX_GETH_MTL_TXQ_UNDERFLOW_UFCNTOVF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_UNDERFLOW_Bits.UFCNTOVF */
#define IFX_GETH_MTL_TXQ_UNDERFLOW_UFCNTOVF_OFF (11u)

/** \brief Length for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TXQPAUSED */
#define IFX_GETH_MTL_TXQ_DEBUG_TXQPAUSED_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TXQPAUSED */
#define IFX_GETH_MTL_TXQ_DEBUG_TXQPAUSED_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TXQPAUSED */
#define IFX_GETH_MTL_TXQ_DEBUG_TXQPAUSED_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TRCSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TRCSTS_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TRCSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TRCSTS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TRCSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TRCSTS_OFF (1u)

/** \brief Length for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TWCSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TWCSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TWCSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TWCSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TWCSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TWCSTS_OFF (3u)

/** \brief Length for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TXQSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TXQSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TXQSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TXQSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TXQSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TXQSTS_OFF (4u)

/** \brief Length for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TXSTSFSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TXSTSFSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TXSTSFSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TXSTSFSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_DEBUG_Bits.TXSTSFSTS */
#define IFX_GETH_MTL_TXQ_DEBUG_TXSTSFSTS_OFF (5u)

/** \brief Length for Ifx_GETH_MTL_TXQ_DEBUG_Bits.PTXQ */
#define IFX_GETH_MTL_TXQ_DEBUG_PTXQ_LEN (3u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_DEBUG_Bits.PTXQ */
#define IFX_GETH_MTL_TXQ_DEBUG_PTXQ_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_DEBUG_Bits.PTXQ */
#define IFX_GETH_MTL_TXQ_DEBUG_PTXQ_OFF (16u)

/** \brief Length for Ifx_GETH_MTL_TXQ_DEBUG_Bits.STXSTSF */
#define IFX_GETH_MTL_TXQ_DEBUG_STXSTSF_LEN (3u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_DEBUG_Bits.STXSTSF */
#define IFX_GETH_MTL_TXQ_DEBUG_STXSTSF_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_DEBUG_Bits.STXSTSF */
#define IFX_GETH_MTL_TXQ_DEBUG_STXSTSF_OFF (20u)

/** \brief Length for Ifx_GETH_MTL_TXQ_ETS_CONTROL_Bits.AVALG */
#define IFX_GETH_MTL_TXQ_ETS_CONTROL_AVALG_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_ETS_CONTROL_Bits.AVALG */
#define IFX_GETH_MTL_TXQ_ETS_CONTROL_AVALG_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_ETS_CONTROL_Bits.AVALG */
#define IFX_GETH_MTL_TXQ_ETS_CONTROL_AVALG_OFF (2u)

/** \brief Length for Ifx_GETH_MTL_TXQ_ETS_CONTROL_Bits.CC */
#define IFX_GETH_MTL_TXQ_ETS_CONTROL_CC_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_TXQ_ETS_CONTROL_Bits.CC */
#define IFX_GETH_MTL_TXQ_ETS_CONTROL_CC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_TXQ_ETS_CONTROL_Bits.CC */
#define IFX_GETH_MTL_TXQ_ETS_CONTROL_CC_OFF (3u)

/** \brief Length for Ifx_GETH_MTL_TXQ_ETS_CONTROL_Bits.SLC */
#define IFX_GETH_MTL_TXQ_ETS_CONTROL_SLC_LEN (3u)

